CavBubbleFsiFoam/exampleCases/ellipse3Dorg/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(
    (   0    0    0)
    (1000    0    0)
    
    (   0   80    0)
    (1000   80    0)
    
    (   0    0 1000)
    (1000    0 1000)
    
    (   0   80 1000)
    (1000   80 1000)
    
    (   0 -240    0)
    (1000 -240    0)
    
    (   0 -160    0)
    (1000 -160    0)
    
    (   0 -240 1000)
    (1000 -240 1000)
    
    (   0 -160 1000)
    (1000 -160 1000)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (50 4 50) simpleGrading (1 1 1)
    hex (8 9 11 10 12 13 15 14) (50 4 50) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch outlet
    (
        (1 3 7 5)
        (4 5 7 6)
        (9 11 15 13)
        (12 13 15 14)
    )
    wall top
    (
        (2 3 7 6)
        (8 9 13 12)
    )
    wall interface
    (
        (0 1 5 4)
        (10 11 15 14)
    )
    symmetryPlane bottom
    (
        (0 1 3 2)
        (8 9 11 10)
    )
    symmetryPlane left
    (
        (0 2 6 4)
        (8 10 14 12)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
