CavBubbleFsiFoam/exampleCases/ellipse3Dorg/fluid/0.org/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    interface
    {
        type            fixedValue;
        value           uniform 1;
    }
    bottom
    {
        type            symmetryPlane;
    }
    left
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
